{"pages":[],"posts":[{"title":"Picture","text":"","link":"/2019/12/05/Picture/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/11/29/hello-world/"},{"title":"Study Plan","text":"Some study plans -First - Basic knowledge Program language (JAVA) Basic algorithm Basic web knowledge Basic design patterns Basic database knowledge -Plan First have a basic knowledge of algorithm and web knowledge 2019.12.10 - 2019.12.18 Half of the online lessons should be studied, 2 hours a day for each pattern. Also should take a stroll in LeetCode dealing with the easy and medium problems. For the web, the important patterns are listed as following: TCP/IP 协议栈有一大部分隐藏于操作系统内核态 *TCP/IP协议体系认知 * 分层。一部分处于用户态，一部分处于内核态。数据链路层，网络层，传输层封装于操作系统内核态。应用层存在于操作系统的用户空间，包括DNS，FTP，HTTPs，HTTP，工作中接触较多的是应用层的部分。但其它层的原理必须理解，面试考察。 层与层之间下层对上层是透明的，传输在每一层是对等的。 数据链路层 以太网帧的格式 MTU（最大传输单元）的概念 ARP协议和RARP协议（地址协议和逆地址协议，网卡MAC地址和IP地址互查机制）（网络层和链路层的中间层）ARP报文格式，查询原理，缓存机制 网络层 掌握IP首部格式：example 十六位分片标识，DF不分片标志，MF更多封片标志，13位片偏移，八位生存时间TTL，16位的首部检验 et. 掌握如何IP分片：如总长大于MTU值，画分片情况；如何避免IP分片（在应用层和传输层做限制）；确定分片顺序；确定分片谁否全部到达。 掌握IP选路，能看懂路由表，Router print,路由表每个字段的含义 掌握ICMP（因特网控制报文协议）：理解为网络层和传输层的中间协议（报文格式）；2种查询报文+5种差错报文。 传输层 掌握UDP协议：无连接，不可靠的特点；首部各字段 掌握TCP协议（面试集中考察）：面向连接，可靠；首部各字段（序号，确认号，首部长度，窗口大小，校验和等特别的，完成可靠功能的部分）；TCP链接控制机制（三次握手，四次挥手，同时打开，同时关闭，半关闭）；TCP流量控制机制（滑动窗口，慢启动，拥塞避免，快传重传，快速回复和算法原理）TCP超时重传机制（四个定时器）；一些问题（为什么三次握手四次挥手？为什么TCP和UDP都存在尾包头？） 应用层 掌握DNS（域名解析）协议：名字空间；DNS指针查询（反向查找或逆向解析）基本原理，DNS缓存。 FTP协议（活化石）：控制链接和数据连接（为什么需要这两种连接）；两种工作模式（PASV+PORT）；各种FTP指令和响应码；FTP断点续传，匿名FTP HTTP协议：报文格式（请求报文，响应报文，请求头各种字段，响应头各种字段）；HTTP状态码。 HTTPS协议：详细握手过程，各种算法（摘要算法，数字签名，数字证书的原理和过程）","link":"/2019/12/10/Study-Plan/"}],"tags":[{"name":"Picture","slug":"Picture","link":"/tags/Picture/"},{"name":"Study","slug":"Study","link":"/tags/Study/"}],"categories":[{"name":"Picture","slug":"Picture","link":"/categories/Picture/"}]}